recipes/pie-dough.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pie Dough</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/css/org.css" /> <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/brands.min.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/recipes/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Pie Dough</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2d8d0c">Pie Dough</a>
<ul>
<li><a href="#org0864ce1">Ingredients</a></li>
<li><a href="#org386c3fc">Instructions</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgd2d8d0c" class="outline-2">
<h2 id="orgd2d8d0c">Pie Dough</h2>
<div class="outline-text-2" id="text-orgd2d8d0c">
</div>
<div id="outline-container-org0864ce1" class="outline-3">
<h3 id="org0864ce1">Ingredients</h3>
<div class="outline-text-3" id="text-org0864ce1">
<p>
For 2 pie dough:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ingredient</th>
<th scope="col" class="org-left">Quantity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Flour</td>
<td class="org-left">250g</td>
</tr>

<tr>
<td class="org-left">Butter</td>
<td class="org-left">125g</td>
</tr>

<tr>
<td class="org-left">Salt</td>
<td class="org-left">2g</td>
</tr>

<tr>
<td class="org-left">Sugar</td>
<td class="org-left">25g</td>
</tr>

<tr>
<td class="org-left">Water</td>
<td class="org-left">5cl</td>
</tr>

<tr>
<td class="org-left">Egg yolk</td>
<td class="org-left">1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org386c3fc" class="outline-3">
<h3 id="org386c3fc">Instructions</h3>
<div class="outline-text-3" id="text-org386c3fc">
<ul class="org-ul">
<li>In a mixer bowl:
<ul class="org-ul">
<li>Add the flour</li>
<li>Cut the butter in small cubes and add</li>
<li>Mix until it has a sand consistency</li>
</ul></li>
<li>Mix the sugar, the egg yolk, the water and the salt until smooth</li>
<li>Pour the liquid solution in the mixer all at once with the mixer stopped</li>
<li>Mix everything, in a few seconds it should all come together in a ball</li>
<li>Take the ball out, spread a little flour on top and refrigerate in plastic wrap</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-05-10 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
